#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cloudacode/vpc-provisioing-ipam/runs/run-fLhUQmrn3s7zqd54

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.aws_vpc_ipam_pool.this: Reading...
data.aws_vpc_ipam_pool.this: Read complete after 0s [id=ipam-pool-08ecf378574aa542e]
data.aws_vpc_ipam_preview_next_cidr.this: Reading...
data.aws_vpc_ipam_preview_next_cidr.this: Read complete after 0s [id=10.1.0.0/16_ipam-pool-08ecf378574aa542e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc-prod.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod"
          + "Org"  = "cloudacode.com"
        }
      + tags_all = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc-prod.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc-prod.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + tags_all         = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + tags_all         = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + tags_all         = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public"
          + "Org"  = "cloudacode.com"
        }
      + tags_all         = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-prod.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-private-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod-public-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-prod.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = (known after apply)
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv4_ipam_pool_id                    = "ipam-pool-08ecf378574aa542e"
      + ipv4_netmask_length                  = 16
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                             = {
          + "Env"  = "prod"
          + "Name" = "cloudacode-prod"
          + "Org"  = "cloudacode.com"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc_cidr_block = (known after apply)
  + vpc_id         = (known after apply)

```

</details>

*Pushed by: @kcfigaro, Action: `pull_request`*